const questions = [
    '您的性别',
    '我喜欢看科技方面的新闻',
    '我的胃口很好',
    '我早上起来的时候，多半觉得睡眠充足，头脑清醒',
    '我想我会喜欢图书管理员的工作',
    '我睡觉时很容易被吵醒',
    '我喜欢看与犯罪有关的新闻',
    '我的手脚经常是很暖和的',
    '我的日常生活中，充满了使我感兴趣的事情',
    '我现在工作（学习）的能力，和从前差不多',
    '我的喉咙里总好像有一块东西堵着似的',
    '一个人应该去了解自己的梦，并从中得到指导或警告',
    '我喜欢看侦探小说或神秘小说',
    '我总是在很紧张的情况下工作',
    '我每个月至少有一、二次拉肚子',
    '偶尔我会想到一些坏得说不出口的事',
    '我深信生活对我是不公平的',
    '我的父亲是一个好人',
    '我很少有便秘的毛病',
    '当我找到一件新的工作时，总喜欢别人秘密告诉我，我应该接近谁',
    '我的性生活是满意的',
    '有时我非常想离开家',
    '有时我会哭一阵笑一阵，连自己也不能控制',
    '恶心和呕吐的毛病使我苦恼',
    '似乎没有一个人理解我',
    '我想我会喜欢当一名歌唱家',
    '当我处境困难的时候，我觉得最好是不开口',
    '有时我觉得有鬼神附在我身上',
    '当别人惹了我时，我觉得只要有机会就应报复，这是理所当然的',
    '我有胃酸过多的毛病，一星期要犯好几次',
    '有时我真想骂人',
    '每隔几个晚上我就做噩梦',
    '我发现我很难把注意力集中到一件工作上',
    '我曾经有过很特别、很奇怪的体验',
    '我时常咳嗽',
    '假如不是有人和我作对，我一定会有更大的成就',
    '我很少担心自己的健康',
    '我从来没有因我的性方面的行为而遇到麻烦',
    '我小的时候，有一段时间我干过小偷小摸的事',
    '有时我真想摔东西',
    '有很多时候我宁愿坐着空想，而不愿做任何事情',
    '我曾一连几天、几个星期、几个月什么也不想干，因为我总是提不起精神',
    '我家里人不喜欢我选择的工作（或将要选择的职业）',
    '我睡得不安稳，容易被惊醒',
    '我常觉得我的头到处都疼',
    '有时我也讲假话',
    '我现在的判断力比以往任何时候都好',
    '每星期至少有一、二次，我突然觉得无缘无故地全身发热',
    '当我与人相处的时候，听到别人谈论稀奇古怪的事，我就心烦',
    '最好是把所有的法律全都废除',
    '有时我觉得我的灵魂离开了我的身体',
    '我的身体和我的大多数朋友一样健康',
    '遇到同学或不常见的朋友，除非他们先向我打招呼，不然我就装作没看见',
    '一位牧师（和尚、道士、神父、阿訇等教士）能用祈祷和把手放在病人头上来治病',
    '认识我的人差不多都喜欢我',
    '我从来没有因为胸痛或心痛而感到苦恼',
    '我小时候，曾经因为胡闹而受过学校的处分',
    '我和别人一见面就熟了，或者说我是自来熟的性格',
    '一切事情都由老天爷或命运安排好了',
    '我时常得听从某些人的指挥，其实他们还不如我高明',
    '我不是每天都看报纸上的每一篇社论',
    '我从未有过正常的生活',
    '我身体的某些部分常有像火烧、刺痛、虫爬或麻木的感觉',
    '我的大便不难控制',
    '有时我会不停地做一件事，直到别人都感到厌烦',
    '我爱我的父亲',
    '我能在我周围看到其他人所看不到的东西、动物或人',
    '我希望我能像别人那样快乐',
    '我几乎从未感到过脖子（颈部）后面疼痛',
    '同性别的人对我有很强的吸引力',
    '我过去曾喜欢玩“丢手帕”之类的游戏',
    '我觉得许多人为了得到别人的同情和帮助，而喜欢夸大自己的不幸',
    '我为每隔几天或经常感到心口（胃）不舒服而烦恼',
    '我是个重要的人物',
    'm我总希望我是个女人f我从不因为我是女人而遗憾',
    '我有时发怒',
    '我时常感到悲观失望',
    '我喜欢看爱情小说',
    '我喜欢诗',
    '我的感情不易受伤害',
    '我有时捉弄动物',
    '我想我会喜欢干森林管理员那一类的工作',
    '和人争辩的时候，我常争不过别人',
    '凡是有能力而且愿意吃苦的人都会有很好的成功机会',
    '现在，我发现自己很容易自暴自弃',
    '有时我被别人的东西，如鞋、手套等等所强烈吸引，虽然这些东西对我毫无用处，但我总想摸摸它或把它偷来',
    '我确实缺少自信心',
    '我愿意做一名花匠',
    '我总觉得人生是有价值的',
    '要使大多数人相信事实的真相，是要经过一番辩论的',
    '有时我将本该今天做的事，拖到明天去做',
    '我不在乎别人拿我开玩笑',
    '我想当个护士',
    '我觉得大多数人是为了向上爬而不惜说谎的',
    '许多事情，我做过以后就后悔了',
    '我几乎每星期都去教堂（或常去寺庙之类的宗教场所）',
    '我很少和家人争吵',
    '有时我有一种强烈的冲动，想去做一些惊人或有害的事',
    '我相信善有善报，恶有恶报',
    '我喜欢参加热闹的聚会',
    '我曾碰到一些千头万绪的问题，使我感到犹豫不决',
    '我认为女性在性生活方面，应该和男性有同等的自由',
    '我认为最难的是控制我自己',
    '我很少有肌肉抽筋或颤抖的毛病',
    '我似乎对什么事情有都不在乎',
    '我身体不舒服的时候，有时会发脾气',
    '我总觉得我自己好像做错了什么事或犯了什么罪',
    '我经常是快乐的',
    '我时常觉得头胀鼻塞似的',
    '有些人太霸道，即使我明知他们是对的，也要和他们对着干',
    '有人想害我',
    '我从来没有为寻求刺激而去做危险的事',
    '我时常认为必须坚持那些我认为正确的事',
    '我相信法制',
    '我常觉得头上好像有一根绷得紧紧的带子',
    '我相信人死后还会有“来世”',
    '我更喜欢我下了赌的比赛或游戏',
    '大部分人之所以是诚实的，主要是因为怕被别人识破',
    '我在上学的时候，有时因胡闹而被教导主任或者校长叫去',
    '我说话总是那样不快也不慢，不含糊也不嘶哑',
    '我在外边和朋友们一起吃饭的时候，比在家规矩得多',
    '我相信有人暗算我',
    '我似乎和我周围的人一样精明能干',
    '我相信有人跟踪我',
    '大多数人不惜用不正当的手段谋取利益，而不愿失掉机会',
    '我的胃有很多毛病',
    '我喜欢戏剧或歌舞剧',
    '我知道我的烦恼是谁造成的',
    '看到血的时候，我既不害怕也不难受',
    '我自己往往弄不清为什么会这样爱生气或发牢骚',
    '我从来没有吐过血，或咯过血',
    '我不为得病而担心',
    '我喜欢栽花或采集花草',
    '我从来没有放纵自己发生过任何不正常的性行为',
    '有时我的思想跑得太快都来不及表达出来',
    '假如我能不买票，白看电影，而且不会被人发觉，我可能会去这样干的',
    '如果别人待我好，我常常怀疑他们别有用心',
    '我相信我的家庭生活，和我所认识的许多人一样幸福快乐',
    '批评和责骂都使我非常伤心',
    '有时我仿佛觉得我必须伤害自己或别人',
    '我喜欢做饭烧菜',
    '我的行为多半受我周围人的习惯所支配',
    '有时我觉得我真是毫无用处',
    '小时候我曾加入过一个团伙，有福共享，有难同当',
    '我喜欢当兵',
    '有时我想借故和别人打架',
    '我喜欢到处乱逛，如果不让我这么做，我会不高兴',
    '由于我经常不能当机立断，因而失去过许多良机',
    '当我正在做一件重要事情的时候，如果有人向我请教或打扰我，我会不耐烦的',
    '我以前写过日记',
    '玩游戏的时候，我只想赢而不愿输',
    '有人一直想毒害我',
    '大多数晚上我睡觉时，不受什么思想干扰',
    '近几年来大部分时间，我的身体都很好',
    '我从来没有过抽风的毛病',
    '现在我的体重既没有增加也没有减轻',
    '有一段时间，我自己做过的事情全不记得了',
    '我觉得我时常无缘无故地受到惩罚',
    '我容易哭',
    '我不能象从前那样理解我所读的东西了',
    '在我一生中，我从来没有感觉到像现在这么好',
    '有时候我觉得我的头顶一碰就疼',
    '我痛恨别人以不正当的手段捉弄我，使我不得不认输',
    '我不容易感到疲倦',
    '我喜欢研究和阅读与我目前工作有关的东西',
    '我喜欢结识一些重要人物，这样会使我感到自己也很重要',
    '我很害怕从高处往下看',
    '即使我家里有人犯法，我也不会紧张',
    '我的脑子有点毛病',
    '我不怕管理钱财',
    '我不在乎别人对我有什么看法',
    '在聚会当中，尽管有人出风头，如果让我也这样做，我会感到很不舒服',
    '我时常需要努力使自己不显出怕羞的样子',
    '我过去喜欢上学',
    '我从来没有晕倒过',
    '我很少头昏眼花',
    '我不大怕蛇',
    '我母亲是个好人',
    '我的记忆力似乎还不错',
    '有关性方面的问题使我烦恼',
    '我觉得我遇到生人的时候就不知道说什么好了',
    '无聊的时候，我就会惹事寻开心',
    '我怕自己会发疯',
    '我反对把钱给乞丐',
    '我时常听到说话的声音，而又不知道它是从哪里来的',
    '我的听觉显然和大多数人一样好',
    '当我要做一件事的时候，我常发现我的手在发抖',
    '我的双手并没有变得笨拙不灵',
    '我能阅读很长的时间，而眼睛不觉得累',
    '许多时候，我觉得浑身无力',
    '我很少头痛',
    '有时当我难为情的时候会出很多汗，这使我非常苦恼',
    '我从未感到走路时不能保持平衡',
    '我没哮喘这一类疾病',
    '我曾有过几次突然不能控制自己的行动或言语，但当时我的头脑还很清醒',
    '我所认识的人里，不是个个我都喜欢',
    '我喜欢到我从来没有到过的地方去游览',
    '有人一直想抢我的东西',
    '我很少空想',
    '我们应该把有关性方面的主要知识告诉孩子',
    '有人想窃取我的思想和计划',
    '但愿我不像现在这样的害羞',
    '我相信我是一个受谴责的人',
    '假若我是一个新闻记者，我会更喜欢报道娱乐圈的新闻',
    '我喜欢做一个新闻记者',
    '有时我会控制不住想要偷一点东西',
    '我相信神，程度超过了大多数人',
    '我喜欢许多不同种类的游戏或娱乐',
    '我喜欢和异性说笑',
    '我相信我的罪恶是不可饶恕的',
    '每种东西吃起来味道都是一样的',
    '我白天能睡觉，晚上却睡不着',
    '我家里的人把我当作小孩子，而不当作大人看待',
    '走路时，我会很小心地跨过人行道上的接缝',
    '我从来没有为皮肤上长点东西而烦恼',
    '我曾经饮酒过度',
    '和别人的家庭比较，我的家庭缺乏爱和温暖',
    '我时常感到自己在为某些事而担忧',
    '当我看到动物受折磨的时候，我并不觉得特别难受',
    '我想我会喜欢建筑承包的工作',
    '我爱我的母亲',
    '我喜欢科学',
    '即使我以后不能报答恩惠，我也愿向朋友求助',
    '我很喜欢打猎',
    '我父母经常反对那些和我交往的人',
    '有时我也会说说人家的闲话',
    '我家里有些人的习惯，使我非常讨厌',
    '有人告诉过我，我在睡觉中会起来梦游',
    '有时我觉得我能非常容易地做出决定',
    '我喜欢同时参加几个团体',
    '我从来没有感到心慌气短',
    '我喜欢谈论两性方面的事',
    '我曾经立志要过一种以责任为重的生活，我一直照此谨慎从事',
    '我有时阻止别人做某些事，并不是因为那种事有多大影响，而是在“道义”上我应该干预他',
    '我很容易生气，但很快就能平静下来',
    '我已独立自主，不受家庭的约束',
    '我有很多心事',
    '我的亲属几乎全都同情我',
    '有时我十分烦躁，坐立不安',
    '我曾经失恋过',
    '我从来不为我的外貌而伤脑筋',
    '我常梦到一些不可告人的事',
    '我相信我并不比别人更为神经过敏',
    '我几乎没有什么地方有疼痛的毛病',
    '我的做事方法容易被人误解',
    '我的父母和家里人对我过于挑剔',
    '我脖子（颈部）上时常出现红斑',
    '我有理由妒忌我家里的某些人',
    '我有时无缘无故地，甚至在不顺利的时候也会觉得非常快乐',
    '我相信死后的世界有魔鬼和地狱',
    '有人想把世界上所能得到的东西都夺到手，我也不会责怪他',
    '我曾经有一阵突然发呆（发愣）停止活动，不知道周围发生了什么事情',
    '谁也不会关心他人的遭遇',
    '有些人所做的事，虽然我认为是错的，但我仍然能够友好地对待他们',
    '我喜欢和一些能互相开玩笑的人在一起相处',
    '在选举的时候，有时我会选出我不熟悉的人',
    '报纸上只有“漫画”最有趣',
    '凡是我所做的事，我都指望能够成功',
    '我相信有上帝（神）',
    '做什么事情，我都感到难以开头',
    '在学校里，我是个笨学生',
    '如果我是个画家，我会更喜欢画花',
    '我虽然相貌不好看，也不因此而苦恼',
    '即使在冷天，我也很容易出汗。',
    '我十分自信',
    '对任何人都不信任，是比较安全的',
    '每星期至少有一两次我十分兴奋',
    '人多的时候，我不知道说些什么话好',
    '在我心情不好的时候，总会有一些事使我高兴起来',
    '我能很容易使人怕我，有时我故意这样作来寻开心',
    '我离家外出的时候，从来不担心家里门窗是否关好或锁好了',
    '我不会责怪一个欺负了自找没趣者的人',
    '我有时精力充沛。',
    '我的皮肤上有一两处麻木了',
    '我的视力和往年一样好',
    '有人控制着我的思想',
    '我喜欢小孩子',
    '有时我非常欣赏骗子的机智，我甚至希望他能侥幸混过去',
    '我时常觉得有些陌生人用挑剔的眼光盯着我',
    '我每天喝特别多的水',
    '大多数人交朋友，是因为朋友对他们有用',
    '我觉得我很少耳鸣',
    '通常我爱家里的人，偶尔也恨他们',
    '假如我是一个新闻记者，我会更愿意报道体育新闻',
    '我确信别人正在议论我',
    '偶尔我听了下流的笑话也会发笑',
    '我独自一个人的时候，感到更快乐',
    '使我害怕的事比我的朋友们少得多',
    '恶心和呕吐的毛病使我苦恼',
    '当一个罪犯可以通过能言善辩的律师开脱罪责时，我对法律感到厌恶',
    '我总是在很紧张的情况下工作的',
    '在我这一生中，至少有一两次我觉得有人用催眠术指挥我做了一些事',
    '我一般不愿意同人讲话，除非对方先开口',
    '有人一直想要左右我的思想',
    '我从来没有犯过法',
    '我喜欢看《红楼梦》这一类的小说',
    '有些时候，我会无缘无故地觉得非常愉快',
    '我希望我不再受那种和性方面有关的念头所困扰',
    '假若有几个人闯了祸，他们最好先编一套假话，而且不改口',
    '我认为我比大多数人更容易动感情',
    '在我的一生当中，从来没有喜欢过洋娃娃',
    '许多时候，生活对我来说是一件吃力的事',
    '我从来没有因我的性方面的行为而遇到麻烦',
    '对于某些事情我很敏感，以至使我不能提及',
    '在学校里，要我在班上发言，是非常困难的',
    '即使和人们在一起，我还是经常感到孤单',
    '应得的同情，我全得到了',
    '我拒绝玩那些我玩不好的游戏',
    '有时我非常想离开家',
    '我交朋友差不多和别人一样容易',
    '我的性生活是满意的',
    '我小的时候，有一段时间我干过小偷小摸的事',
    '我不喜欢有人在我的身旁',
    '有人不将自己的贵重物品保管好因而引起别人偷窃，这种人和小偷一样应受责备',
    '偶尔我会想到一些坏得说不出口的事',
    '我深信生活对我是不公平的',
    '我想差不多每个人，都会为了避免麻烦说点假话',
    '我比大多数人更敏感',
    '在我的日常生活中，充满着使我感兴趣的事情',
    '大多数人，都是内心不愿意挺身而出去帮助别人的',
    '我的梦有好些是关于性方面的事',
    '我很容易感到难为情',
    '我为金钱和事业忧虑',
    '我曾经有过很特殊很奇怪的体验',
    '我从来没有爱上过任何人',
    '我家里有些人所做的事，使我吃惊',
    '有时我会哭一阵，笑一阵，连自己也不能控制',
    '我的母亲或父亲时常要我服从他，即使我认为是不合理的',
    '我发现我很难把注意力集中到一件工作上',
    '我几乎从不做梦',
    '我从来没有瘫痪过，或是感到肌肉非常软弱无力',
    '假如不是有人和我作对，我一定会有更大的成就',
    '即使我没有感冒，我有时也会发不出声音或声音改变',
    '似乎没有人理解我',
    '有时我会闻到奇怪的气味',
    '我不能专心于一件事情上',
    '我很容易对人感到不耐烦',
    '我几乎整天都在为某件事或某个人而焦虑',
    '我所操心的事，远远超过了我所应该操心的范围',
    '大部分时间，我觉得我还是死了的好',
    '有时我会兴奋得难以入睡',
    '有时我的听觉太灵敏了，反而使我感到烦恼',
    '别人对我说的话，我立刻就忘记了',
    '哪怕是琐碎的小事，我也会再三考虑后才去做',
    '有时为了避免和某些人相遇，我会绕道而行',
    '我常常觉得好像一切都不是真的',
    '我有一个习惯，喜欢点数一些不重要的东西，像路上的电线杆等等',
    '我没有真正想伤害我的仇人',
    '我提防那些对我过分亲近的人',
    '我有一些奇怪和特别的念头',
    '在我独处的时候，我会听到奇怪的声音',
    '当我必须短期离家出门的时候，我会感到心神不定',
    '我怕一些东西或人，虽然我明知他们是不会伤害我的',
    '如果屋子里已经有人聚在一起谈话，这时要我一个人进去，我是一点也不害怕的',
    '我害怕使用刀子或任何尖利的东西',
    '有时我喜欢折磨我所爱的人',
    '我似乎比别人更难于集中注意力',
    '有好几次我放弃正在做的事，因为我感到自己的能力太差了',
    '我脑子里常常出现一些坏的可怕的字眼，我却无法摆脱它们',
    '有时一些无关紧要的念头缠着我，使我好多天都感到不安',
    '几乎每天都有使我感到害怕的事情发生',
    '我总是将事情看得严重些',
    '我比大多数人更敏感。',
    '有时我喜欢受到我心爱的人的折磨',
    '有人用侮辱性的和下流的话议论我',
    '我呆在屋里总感到不安',
    '即使和人们在一起，我仍经常感到孤单',
    '我并不是特别害羞拘谨',
    '有时我的头脑似乎比平时迟钝',
    '在社交场合，我多半是一个人坐着，或者只跟另一个人坐在一起，而不到人群里去',
    '人们常使我失望',
    '我喜欢参加舞会',
    '有时我感到困难重重，无法克服',
    '我常想：“我要是能再成为一个孩子就好了”',
    '如果给我机会，我一定能做些对世界大有益处的事',
    '我时常遇见一些所谓的专家，他们并不比我高明',
    '当我听说我所熟悉的人成功了，我就觉得自己失败了',
    '如果有机会，我一定能成为一个人民的好领袖',
    '下流的故事使我感到不好意思',
    '一般来说人们要求别人尊重自己比较多，而自己却很少尊重别人',
    '我总想把好的故事记住，讲给别人听',
    '我喜欢搞输赢不大的赌博',
    '为了可以和人们在一起，我喜欢社交活动。',
    '我喜欢人多热闹的场合',
    '当我和一群快活的朋友在一起的时候，我的烦恼就烟消云散了',
    '当人们说我同伙的闲话时，我从来不参与',
    '只要我开始做一件事，就很难放下，哪怕是暂时的',
    '我的小便不困难，也不难控制',
    '我常发现别人妒忌我的好主意，因为他们没能先想到',
    '只要有可能，我就会避开人群',
    '我不怕见生人',
    '记得我曾经为了逃避某件事而装过病',
    '在火车和公共汽车上，我常跟陌生人交谈',
    '当事情不顺利的时候，我就想立即放弃。',
    '我喜欢让人家知道我对于事物的态度',
    '有些时间，我感到劲头十足，以至一连好几天都不需要睡觉',
    '在人群中，如果叫我带头发言，或对我所熟悉的事情发表意见，我并不感到不好意思',
    '我喜欢聚会和社交活动',
    '面对困难或危险的时候，我总退缩不前',
    '我原来想做的事，假若别人认为不值得做，我很容易放弃',
    '我不怕火',
    '我不怕水',
    '对某些事我常常是仔细考虑后才做出决定',
    '生活在这个丰富多彩的时代里是多么美好',
    '当我想纠正别人的错误和帮助他们的时候，我的好意常被误解',
    '我无吞咽困难',
    '我有时回避见人，因为我怕我会做出或讲出一些事后令我懊悔的事',
    '我通常很镇静，不容易激动',
    '我不轻易流露自己的感情，以至于人家伤害了我，他自己还不知道',
    '有时我因为承担的事情太多，而使自己精疲力竭',
    '我当然乐于以其人之道还治其人之身',
    '宗教不使我烦恼',
    '我生病或受伤的时候，不怕找医生',
    '我有罪，应受重罚',
    '我把失望的事看得太重，以至于总忘不了',
    '我很不喜欢匆匆忙忙地干工作',
    '虽然我明知自己能把事做好，但是我也怕别人看着我做',
    '在排队的时候如果有人插到我前面去，我会感到恼火而指责他',
    '有时我觉得自己一无是处',
    '小时候我时常逃学',
    '我曾经有过很不寻常的宗教体验',
    '我家里有人很神经过敏',
    '我因为家里有的人所从事过的职业而感到不好意思',
    '我很喜欢（或者喜欢过）钓鱼',
    '我几乎总感到肚子饿',
    '我经常做梦',
    '有时只好用不客气的态度去对付那些粗鲁或令人厌恶的人',
    '我倾向于对各种不同爱好发生兴趣，而不愿意长期坚持其中的某一种',
    '我喜欢阅读报纸的社论',
    '我喜欢听主题严肃的演说',
    '我易受异性的吸引',
    '我相当担心那些可能发生的不幸',
    '我有着坚定的政治见解',
    '我曾经有过想像的同伴',
    '我希望能成为一个摩托车运动员',
    '我通常喜欢和女性一起工作',
    '我确信只有一种宗教是真的',
    '只要你不是真正地犯法，钻法律的空子是可以的',
    '有些人讨厌极了，我会因为他们自食其果而暗中高兴',
    '要我等待，我就紧张',
    '当我兴高采烈的时候，见到别人忧郁消沉就使我大为扫兴',
    '我喜欢身材高的女人',
    '有些时期我因忧虑而失眠',
    '假若别人认为我对某些事的做法不妥当的话，我很容易放弃',
    '我不想去纠正那些发表愚昧无知见解的人',
    '我年轻（童年）的时候，喜欢寻求刺激',
    '警察通常是诚实的',
    '当别人反对我的意见时，我会不惜一切去说服他',
    '在街上、车上或在商店里，如果有人注视我，我会觉得不安',
    '我不喜欢看到妇女吸烟',
    '我很少有忧郁的毛病',
    '如果有人对我所熟悉的事情发表愚蠢和无知的意见，我总是没法纠正他',
    '我喜欢开别人的玩笑',
    '我小时候，对参加团伙不热心',
    '独自住在深山或老林的小木屋里，我也会觉得快乐',
    '许多人都说我是急性子',
    '如果一个人触犯了一条他认为不合理的法律，他是不应该受到惩罚的',
    '我认为一个人决不应该喝酒',
    '小时候和我关系密切的人（父亲、继父等）对我十分严厉',
    '我有几种坏习惯，已经根深蒂固，难于改正',
    '我只适量地喝一点酒（或者一点也不喝）',
    '我希望我能摆脱因为破口伤人而引起的烦恼',
    '我觉得不能把自己的一切都告诉别人',
    '我从前喜欢玩“跳房子”（或跳橡皮筋）的游戏',
    '我从来没有见过幻象',
    '对于我的终身职业，我已经好几次改变过主意',
    '除了医生的嘱咐，我从来不服用任何药物或安眠药',
    '我时常默记一些无关紧要的号码（如汽车牌照等）',
    '我时常因为自己爱发脾气和爱抱怨而感到懊悔',
    '闪电是我害怕的东西中的一种',
    '有关性方面的事使我厌恶',
    '在学校中老师对我的品行评定总是很不好',
    '火对我有一种诱惑力。',
    '我喜欢让别人猜测我下一步的活动',
    '我的小便次数不比别人多',
    '万不得已的时候，我只吐露一些无损于自己的那部分实情',
    '我是上帝（神）派来的特使',
    '假如我和几个朋友有着同样的过错，我宁可一人承担而不愿连累别人',
    '我还从来没有因为家里人惹了事而自己感到特别紧张',
    '人与人之间的相互欺骗是我所知道的唯一的奇迹',
    '我常常怕黑暗',
    '我害怕一个人单独呆在黑暗中',
    '我的计划看来总是困难重重，使我不得不一一放弃',
    '上帝（神）创造奇迹',
    '有些缺点，我只好承认并设法加以控制，但无法消除',
    '一个男人和一个女人相处的时候，他通常想到的是关于她的性方面的事',
    '我从来没有发现我尿中有血',
    '当我试图使别人不犯错误，而做的事被人误解的时候，我往往感到十分难过',
    '每星期我祈祷几次',
    '我同情那些不能摆脱苦恼和忧愁的人',
    '我每星期念几次经',
    '对认为世界上只有一种宗教是真的那些人，我感到不耐烦',
    '我想起地震就害怕',
    '我喜欢那种需要注意力集中的工作，而不喜欢省心（不费劲）的工作',
    '我怕自己被关在小房间里或禁闭的小地方',
    '对那些我想帮助他们改正或提高的人，我总是坦率地交底',
    '我从来没有过将一件东西看成两件（复视现象）',
    '我喜欢探险小说',
    '坦率永远是一件好事',
    '我必须承认，我有时会不合理地担心一些无关紧要的事情',
    '我很乐意百分之百的接受一个好意见',
    '我一向总是靠自己解决问题，而不是找人教我怎样做',
    '风暴使我惊慌',
    '我经常不对别人的行动表示强烈的赞成或反对',
    '我不想隐瞒我对一个人的坏印象或同情，免得他不知道我对他的看法',
    '我认为“不肯拉车的马应该受到鞭打”',
    '我是个神经高度紧张的人',
    '我经常遇到一些顶头上司，他们把功劳归于自己，把错误推给下级',
    '我相信我的嗅觉和别人一样好',
    '因为我太拘谨，所以有时我难于坚持自己的正确意见',
    '肮脏使我害怕或恶心',
    '我有一种不愿告诉别人的梦幻生活',
    '我不喜欢洗澡',
    '我认为为别人谋求幸福比自己争取自由更为伟大',
    '我喜欢有男子气的女人',
    '我们家总是不愁吃不愁穿',
    '我家里有些人脾气急躁',
    '我无论什么事情都做不好',
    '我经常感到惭愧，因为我对某些事情想的和做的不一样',
    '我的性器官有点毛病',
    '我总是强烈地坚持自己的意见',
    '我常常向别人请教',
    '我不害怕蜘蛛',
    '我从来不脸红',
    '我不怕从门把上传染上疾病',
    '有些动物使我神经紧张',
    '我的前途似乎没有希望',
    '我家里人和近亲们相处得很好',
    '我并不容易比人脸红',
    '我喜欢穿高档的衣服',
    '我常常担心自己会脸红',
    '即使我以为自己对某种事已经打定了主意，别人也很容易使我变卦或改变主意',
    '我和别人一样能够忍受同量的痛苦',
    '我并不因为常常打嗝（呃逆）而觉得很烦恼',
    '有好几次都是我一个人坚持到底，最后才放弃了所做的事',
    '我几乎整天感到口干',
    '只要有人催我，我就生气',
    '我想去深山野林中打老虎',
    '我想我会喜欢裁缝的工作',
    '我不怕老鼠',
    '我的面部从来没有麻痹过',
    '我的皮肤似乎对触摸特别敏感',
    '我从来没有过像柏油一样的黑粪便',
    '每星期我总有几次觉得好像有可怕的事情要发生',
    '我大部分时间都感到疲倦',
    '有时我一再做同样的梦',
    '我喜欢阅读有关历史的书籍',
    '未来是变化无常的，一个人很难做出认真的安排',
    '如果可以避免的话，我决不去看色情电影',
    '许多时候，即使一切顺利，我对任何事情都觉得无所谓',
    '我喜欢修理门锁',
    '有时我可以肯定别人知道我在想什么',
    '我喜欢阅读有关科学的书籍',
    '我害怕单独呆在空旷的地方',
    '假如我是个画家，我喜欢画小孩子',
    '有时我觉得我就要垮了',
    '我很注意我的衣着式样',
    '我喜欢当一个私人秘书',
    '许多人都因为有过不良的性行为而感到惭愧',
    '我经常在半夜里受惊吓',
    '我经常因为记不清把东西放在哪里而感到苦恼',
    '我很喜欢骑马',
    '小时候，我最依恋和钦佩的是一个女人（祖母、母亲、姐姐、姑、婶、姨等）',
    '我喜欢探险小说胜过爱情小说',
    '我不轻易生气',
    '当我站在高处的时候，我就很想往下跳',
    '我喜欢电影里的爱情镜头'
];

let answers = [true];

let currentIndex = 0;
let age = 0;
let tName = "";
let testStarted = 0;
let jsonData = "";
let textData = "";
let orgScore = {
    'Q': 0,
    'L': 0,
    'F': 0,
    'K': 0,
    'Hs': 0,
    'D': 0,
    'Hy': 0,
    'Pd': 0,
    'Mf': 0,
    'Pa': 0,
    'Pt': 0,
    'Sc': 0,
    'Ma': 0,
    'Si': 0,
    'Mas': 0,
    'Dy': 0,
    'Do': 0,
    'Re': 0,
    'Cn': 0
}
let proScore = {
    'Q': 0,
    'L': 0,
    'F': 0,
    'K': 0,
    'Hs': 0,
    'Hs+0.5K': 0,
    'D': 0,
    'Hy': 0,
    'Pd': 0,
    'Pd+0.4K': 0,
    'Mf': 0,
    'Pa': 0,
    'Pt': 0,
    'Pt+1.0K': 0,
    'Sc': 0,
    'Sc+1.0K': 0,
    'Ma': 0,
    'Ma+0.2K': 0,
    'Si': 0,
    'Mas': 0,
    'Dy': 0,
    'Do': 0,
    'Re': 0,
    'Cn': 0
}

let accepted = false;

function onAcceptBtnClick() {
    if(!accepted) {
        accepted = true;
        document.getElementById("divPrompt").textContent = "请点击最符合您自己的选项，或者通过按键\"W\"选择是，按键\"E\"选择否。可以按\"Q\"来返回上一题";
    }
    else {
        document.getElementById("ula").style.display = "none";
        document.getElementById("div-tb").style.display = "flex";
    }
}
function onSubmitBtnClick() {
    if(age === 0) {
        age = document.getElementById("ans-tb").value;
        //document.getElementById("").style.display = "none";
        if(age < 13 || age > 70) {
            document.getElementById("div-tb").style.display = "none";
            document.getElementById("notEnough-age").style.display = "";
            return;
        }
        document.getElementById("lb-tbPrompt").textContent = "请输入被试者姓名";
        document.getElementById("ans-tb").type = "text";
        document.getElementById("ans-tb").value = "";

    }else {
        tName = document.getElementById("ans-tb").value;
        document.getElementById("div-tb").style.display = "none";
        document.getElementById("questions").style.display = "";
        if(currentIndex === 0) {
            document.getElementById("ans-yes").textContent = "男";
            document.getElementById("ans-no").textContent = "女";
        }
        //test already started
        testStarted = Date.now();
    }

}

function onClickAns(ans) {
    if(currentIndex >= 566) {
        answers[currentIndex] = ans;
        endTest();
        return;
    }
    if(currentIndex === 0) {
        document.getElementById("ans-yes").textContent = "是";
        document.getElementById("ans-no").textContent = "否";
        answers[0] = ans;
    }else {
        answers[currentIndex] = ans;
    }
    currentIndex++;
    if(currentIndex === 74) {
        if(answers[0] === true) {
            document.getElementById("question").textContent = currentIndex.toString() + ".我总希望我是个女人";
        }else {
            document.getElementById("question").textContent = currentIndex.toString() + ".我从不因为我是女人而遗憾";
        }
    }else {
        document.getElementById("question").textContent = currentIndex.toString() + "." + questions[currentIndex];
    }
}

function prevQuestion() {
    if(currentIndex <= 0) return;
    currentIndex--;
    document.getElementById("question").textContent = currentIndex.toString() + "." + questions[currentIndex];
}

let norm_m;
let norm_sd;

function calcDiff(a, b) {
    if(answers[a] !== answers[b]) {
        return 1;
    }
    return 0;
}

function calcTrue(a) {
    return answers[a] === true ? 1 : 0;
}

function calcFalse(a) {
    return answers[a] === true ? 0 : 1;
}

function calcT(score, m, sd) {
    return Math.round(50 + 10 * (score - m) / sd);
}

function calcScaleT(scale) {
    proScore[scale] += calcT(orgScore[scale], norm_m[scale], norm_sd[scale]);
}
function calcScale(scale, slt, slf) {
    for(let i = 0; i < slt.length; i++) {
        orgScore[scale] += calcTrue(slt[i]);
    }
    for(let i = 0; i < slf.length; i++) {
        orgScore[scale] += calcFalse(slf[i]);
    }
    calcScaleT(scale);
}

//for debug
function debugGo(ansS) {
    onAcceptBtnClick();
    onAcceptBtnClick();
    document.getElementById("ans-tb").value = 14;
    onSubmitBtnClick();
    document.getElementById("ans-tb").value = "DEBUG DATA!!!";
    onSubmitBtnClick();
    if(ansS === null || ansS === [] || ansS.length !== 568) {
        console.log("[DEBUG]Generating random data");
        for(let i = 0; i < questions.length; i++) {
            onClickAns(Math.round(Math.random()) !== 0);
        }
        return;
    }
    console.log(ansS.length);
    for(let i = 0; i < ansS.length; i++) {
        onClickAns(ansS[i] !== 0);
    }
}

let downloadJsonA;
let downloadTextA;

function endTest() {
    let testDuration = Date.now() - testStarted;
    document.getElementById("questions").style.display = "none";
    document.getElementById("endTest").style.display = "";
    //中国1982版常模
    if(answers[0] === true) { //male
        norm_m = {
            'L': 5.70,
            'F': 13.68,
            'K': 13.00,
            'Hs': 8.78,
            'D': 26.16,
            'Hy': 22.07,
            'Pd': 18.98,
            'Mf': 27.56,
            'Pa': 12.84,
            'Pt': 17.86,
            'Sc': 23.01,
            'Ma': 18.48,
            'Si': 34.51,
            'Hs+0.5K': 15.42,
            'Pd+0.4K': 24.38,
            'Pt+1.0K': 31.14,
            'Sc+1.0K': 36.47,
            'Ma+0.2K': 21.22,
            'Mas': 18.86,
            'Dy': 26.09,
            'Do': 15.39,
            'Re': 20.54,
            'Cn': 25.26
        }
        norm_sd = {
            'L': 2.52,
            'F': 6.86,
            'K': 4.66,
            'Hs': 4.75,
            'D': 4.97,
            'Hy': 5.36,
            'Pd': 4.36,
            'Mf': 4.04,
            'Pa': 3.92,
            'Pt': 7.93,
            'Sc': 10.15,
            'Ma': 5.26,
            'Si': 6.88,
            'Hs+0.5K': 4.79,
            'Pd+0.4K': 4.27,
            'Pt+1.0K': 5.71,
            'Sc+1.0K': 8.24,
            'Ma+0.2K': 4.88,
            'Mas': 7.45,
            'Dy': 8.05,
            'Do': 3.12,
            'Re': 4.13,
            'Cn': 3.76

        }
    }else { //female
        norm_m = {
            'L': 5.64,
            'F': 11.69,
            'K': 12.25,
            'Hs': 9.83,
            'D': 28.40,
            'Hy': 22.82,
            'Pd': 18.29,
            'Mf': 31.83,
            'Pa': 12.62,
            'Pt': 18.77,
            'Sc': 22.50,
            'Ma': 16.64,
            'Si': 37.27,
            'Hs+0.5K': 16.35,
            'Pd+0.4K': 23.33,
            'Pt+1.0K': 31.17,
            'Sc+1.0K': 34.89,
            'Ma+0.2K': 19.18,
            'Mas': 20.43,
            'Dy': 29.12,
            'Do': 15.10,
            'Re': 21.78,
            'Cn': 24.86
        }
        norm_sd = {
            'L': 2.48,
            'F': 5.02,
            'K': 4.26,
            'Hs': 4.98,
            'D': 5.04,
            'Hy': 5.54,
            'Pd': 4.45,
            'Mf': 3.86,
            'Pa': 3.93,
            'Pt': 7.82,
            'Sc': 9.57,
            'Ma': 5.16,
            'Si': 6.71,
            'Hs+0.5K': 4.95,
            'Pd+0.4K': 4.44,
            'Pt+1.0K': 5.86,
            'Sc+1.0K': 7.63,
            'Ma+0.2K': 4.89,
            'Mas': 7.35,
            'Dy': 7.61,
            'Do': 2.76,
            'Re': 3.13,
            'Cn': 3.70
        }
    }

    //Question Scale
    let sl1 = [8, 13, 15, 16, 20, 21, 22, 23, 24, 32, 33, 35, 37, 38, 305, 317];
    let sl2 = [318, 290, 314, 315, 310, 308, 326, 288, 333, 328, 323, 331, 302, 311, 366, 362];

    for(let i = 0; i < sl1.length; i++) {
        orgScore['Q'] += calcDiff(sl1[i], sl2[i])
    }

    proScore['Q'] = orgScore['Q'];

    //Lie Scale
    sl1 = [15, 30, 45, 60, 75, 90, 105, 120, 135, 150, 165, 195, 225, 255, 285];

    calcScale('L', [], sl1);

    //inFrequency or Fake bad
    sl1 = [14, 27, 31, 34, 35, 40, 42, 48, 49, 50, 53, 56, 66, 85, 121, 123, 139, 146, 151, 156, 168, 184, 197, 200, 202, 205, 206, 209, 210, 211, 215, 218, 227, 245, 246, 247, 252, 256, 269, 275, 286, 288, 291, 293];
    sl2 = [17, 20, 54, 65, 75, 83, 112, 113, 115, 164, 169, 177, 185, 196, 199, 220, 257, 258, 272, 276]

    calcScale('F', sl1, sl2);

    //K defensiveness
    // sl1 = 96
    sl2 = [30, 39, 71, 89, 124, 129, 134, 138, 142, 148, 160, 170, 171, 180, 183, 217, 234, 267, 272, 296, 316, 322, 368, 370, 372, 373, 375, 386, 394]

    calcScale('K', [96], sl2);
    let k = orgScore['K'];

    //Hs Hypochondriacs
    sl1 = [23, 29, 43, 62, 72, 108, 114, 125, 161, 189, 273];
    sl2 = [2, 3, 7, 9, 18, 51, 55, 63, 68, 103, 130, 153, 155, 163, 175, 188, 190, 192, 230, 243, 274, 281];

    calcScale('Hs', sl1, sl2);
    proScore['Hs+0.5K'] = calcT(orgScore['Hs'] + Math.round(0.5 * k), norm_m['Hs+0.5K'], norm_sd['Hs+0.5K']);

    //Depression
    sl1 = [5, 32, 41, 43, 52, 67, 86, 104, 130, 138, 142, 158, 159, 182, 189, 193, 236, 259, 288, 290];
    sl2 = [2, 8, 9, 18, 30, 36, 39, 46, 51, 57, 58, 64, 80, 88, 89, 95, 98, 107, 122, 131, 145, 152, 153, 154, 155, 160, 178, 191, 207, 208, 233, 241, 242, 248, 263, 270, 271, 272, 285, 296];

    calcScale('D', sl1, sl2);

    //Hy Hysteria
    sl1 = [10, 23, 32, 43, 44, 47, 76, 114, 179, 186, 189, 238, 253];
    sl2 = [2, 3, 6, 7, 8, 9, 12, 26, 30, 51, 55, 71, 89, 93, 103, 107, 109, 124, 128, 129, 136, 137, 141, 147, 153, 160, 162, 163, 170, 172, 174, 175, 180, 188, 190, 192, 201, 213, 230, 234, 243, 265, 267, 274, 279, 289, 292];

    calcScale('Hy', sl1, sl2);

    //Pd Psychopathic deviate
    sl1 = [16, 21, 24, 32, 33, 35, 38, 42, 61, 67, 84, 94, 102, 106, 110, 118, 127, 215, 216, 224, 239, 244, 245, 284];
    sl2 = [8, 20, 37, 82, 91, 96, 107, 134, 137, 141, 155, 170, 171, 173, 180, 183, 201, 231, 235, 237, 248, 267, 287, 289, 294, 296]

    calcScale('Pd', sl1, sl2);
    proScore['Pd+0.4K'] = calcT(orgScore['Pd'] + Math.round(0.4 * k), norm_m['Pd+0.4K'], norm_sd['Pd+0.4K']);

    //Mf Masculinity-femininity
    if(answers[0] === true) { //Mf-m
        sl1 = [4, 25, 69, 70, 74, 77, 78, 87, 92, 126, 132, 134, 140, 149, 179, 187, 203, 204, 217, 226, 231, 239, 261, 278, 282, 295, 297, 299];
        sl2 = [1, 19, 26, 28, 79, 80, 81, 89, 99, 112, 115, 116, 117, 120, 133, 144, 176, 198, 213, 214, 219, 221, 223, 229, 249, 254, 260, 262, 264, 280, 283, 300];
    } else {
        sl1 = [4, 25, 70, 74, 77, 78, 87, 92, 126, 132, 133, 134, 140, 149, 187, 203, 204, 217, 226, 239, 261, 278, 282, 295, 299];
        sl2 = [1, 19, 26, 28, 69, 79, 80, 81, 89, 99, 112, 115, 116, 117, 120, 144, 176, 179, 198, 213, 214, 219, 221, 223, 229, 231, 249, 254, 260, 262, 264, 280, 283, 297, 300];
    }

    calcScale('Mf', sl1, sl2);

    //Pa Paranoia
    sl1 = [16, 24, 27, 35, 110, 121, 123, 127, 151, 157, 158, 202, 275, 284, 291, 293, 299, 305, 314, 317, 326, 338, 341, 364, 365];
    sl2 = [93, 107, 109, 111, 117, 124, 268, 281, 294, 313, 316, 319, 327, 347, 348];

    calcScale('Pa', sl1, sl2);

    //Pt Psychasthenia
    sl1 = [10, 15, 22, 32, 41, 67, 76, 86, 94, 102, 106, 142, 159, 182, 189, 217, 238, 266, 301, 304, 321, 336, 337, 340, 342, 343, 344, 346, 349, 351, 352, 356, 357, 358, 359, 360, 361, 362, 366];
    sl2 = [3, 8, 36, 122, 152, 164, 178, 329, 353];

    calcScale('Pt', sl1, sl2);
    proScore['Pt+1.0K'] = calcT(orgScore['Pt'] + k, norm_m['Pt+1.0K'], norm_sd['Pt+1.0K']);

    //Sc Schizophrenia
    sl1 = [15, 22, 40, 41, 47, 52, 76, 97, 104, 121, 156, 157, 159, 168, 179, 182, 194, 202, 210, 212, 238, 241, 251, 259, 266, 273, 282, 291, 297, 301, 303, 307, 308, 311, 312, 315, 320, 323, 324, 325, 328, 331, 332, 333, 334, 335, 339, 341, 345, 349, 350, 352, 354, 355, 356, 360, 363, 364, 366];
    sl2 = [17, 65, 103, 119, 177, 178, 187, 192, 196, 220, 276, 281, 302, 306, 309, 310, 318, 322, 330];

    calcScale('Sc', sl1, sl2);
    proScore['Sc+1.0K'] = calcT(orgScore['Sc'] + k, norm_m['Sc+1.0K'], norm_sd['Sc+1.0K']);

    //Ma Hypomania
    sl1 = [11, 13, 21, 22, 59, 64, 73, 97, 100, 109, 127, 134, 143, 156, 157, 167, 181, 194, 212, 222, 226, 228, 232, 233, 238, 240, 250, 251, 263, 266, 268, 271, 277, 279, 298];
    sl2 = [101, 105, 111, 119, 120, 148, 166, 171, 180, 267, 289];

    calcScale('Ma', sl1, sl2);
    proScore['Ma+0.2K'] = calcT(orgScore['Ma'] + Math.round(0.2 * k), norm_m['Ma+0.2K'], norm_sd['Ma+0.2K']);

    //Si Social introversion
    sl1 = [32, 67, 82, 111, 117, 124, 138, 147, 171, 172, 180, 201, 236, 267, 278, 292, 304, 316, 321, 332, 336, 342, 357, 369, 370, 373, 376, 378, 379, 385, 389, 393, 398, 399];
    sl2 = [25, 33, 57, 91, 99, 110, 126, 143, 193, 208, 229, 231, 254, 262, 281, 296, 309, 353, 359, 367, 371, 374, 377, 380, 381, 382, 383, 384, 387, 388, 390, 391, 392, 395, 396, 397];

    calcScale('Si', sl1, sl2);

    //Mas Manifest anxiety
    sl1 = [13, 14, 23, 31, 32, 43, 67, 86, 125, 142, 158, 186, 191, 217, 238, 241, 263, 301, 317, 321, 322, 335, 337, 340, 352, 361, 372, 398, 418, 424, 431, 439, 442, 499, 506, 530, 555];
    sl2 = [7, 18, 107, 163, 190, 230, 242, 264, 287, 367, 407, 520, 528];

    calcScale('Mas', sl1, sl2);

    //Dy Dependency
    sl1 = [19, 21, 24, 41, 63, 67, 70, 82, 86, 98, 100, 138, 141, 158, 165, 180, 189, 201, 212, 236, 239, 259, 267, 304, 305, 321, 337, 338, 343, 357, 361, 362, 370, 372, 373, 393, 398, 399, 408, 440, 443, 461, 487, 488, 489, 509, 521, 531, 554];
    sl2 = [9, 79, 107, 163, 170, 193, 264, 411];

    calcScale('Dy', sl1, sl2);

    //Do Dominance
    sl1 = [64, 229, 255, 270, 406, 432, 523];
    sl2 = [32, 61, 82, 86, 94, 186, 223, 224, 240, 249, 250, 267, 268, 304, 343, 356, 419, 483, 547, 558, 562];

    calcScale('Do', sl1, sl2);

    //Re Social responsibility
    sl1 = [58, 111, 173, 221, 294, 412, 501, 552];
    sl2 = [6, 28, 30, 33, 56, 116, 118, 157, 175, 181, 223, 224, 260, 304, 388, 419, 434, 437, 468, 471, 472, 529, 553, 558];

    calcScale('Re', sl1, sl2);

    //Cn Control
    sl1 = [6, 20, 30, 56, 67, 105, 116, 134, 145, 162, 169, 181, 225, 236, 238, 285, 296, 319, 337, 376, 379, 381, 418, 447, 460, 461, 529, 555];
    sl2 = [58, 80, 92, 96, 111, 167, 174, 220, 242, 249, 250, 291, 313, 360, 439, 444, 449, 483, 488, 489, 527, 548];

    calcScale('Cn', sl1, sl2);

    delete orgScore["undefined"]
    delete proScore["undefined"]

    let date = new Date();
    const testDate = date.getFullYear().toString() + "-" + (date.getMonth() + 1).toString() + "-" + date.getDate().toString();

    jsonData = JSON.stringify({"Name" : tName, "Age" : age, "Date" : testDate, "Duration" : testDuration, "OriginalScore": orgScore, "ModifiedScore": proScore, "Answers": answers});
    textData = "MMPI测试 " + testDate + "\n姓名:" + tName + "\n年龄:" + age.toString() + "\n测试用时:" + testDuration.toString() + "ms";
    textData += "\n原始分\n";
    for(let k in orgScore) {
        textData += k + ":" + orgScore[k].toString() + "\n";
    }
    textData += "标准分\n";
    for(let k in proScore) {
        textData += k + ":" + proScore[k].toString() + "\n";
    }
    textData += "答案\n";
    for(i = 0; i < answers.length; i++) {
        textData += questions[i].toString() + ":" + answers[i].toString() + "\n";

    }
    textData += "WebMMPI生成: https://y2f.xyz/mmpi";

    document.getElementById("testEndPrompt").textContent = "分数计算完成";

    downloadJsonA = document.createElement("a");
    downloadTextA = document.createElement("a");
    downloadJsonA.style.display = "none";
    downloadTextA.style.display = "none";

    let blobJSON = new Blob([jsonData]);
    let blobText = new Blob([textData]);
    downloadJsonA.href = url.createObjectURL(blobJSON);
    downloadTextA.href = url.createObjectURL(blobText);
    downloadJsonA.download = tName + " MMPI " + testDate + ".json";
    downloadTextA.download = tName + " MMPI " + testDate + ".txt";

}

const url = window.URL || window.webkitURL || window;

function downloadJSON() {
    downloadJsonA.click();
}

function downloadText() {
    downloadTextA.click();
}